/**
  * @file    delay.h 
  * @author  Z B T
  * @version V0.1
  * @date    2016-01-29
  * @brief   粗略延时函数
  */  

#ifndef __DELAY_H
#define __DELAY_H

/** 头文件包含区 --------------------------------------------------- */
#include "stm32f10x.h"

/** 公有宏(类型定义) ----------------------------------------------- */

/** 结构、枚举 ----------------------------------------------------- */

/** 文件接口 ------------------------------------------------------- */
void delay_n_us(uint16_t n);
void delay_n_ms(uint16_t n);

#endif
