/**
  * @file    delay.c 
  * @author  Z B T
  * @version V0.1
  * @date    2016-01-29
  * @brief   粗略延时函数
  */  

/** 头文件包含区 --------------------------------------------------- */
#include "delay.h"

/** 私有宏(类型定义) ----------------------------------------------- */ 

/** 外部变量 ------------------------------------------------------- */

/** 私有函数原型 --------------------------------------------------- */

/** 公有函数 ------------------------------------------------------- */

/**
  *  @brief 粗略延时n us
  *  @param None
  *  @return None
  */
void delay_n_us(uint16_t n)
{
    uint8_t i = 0;

    while (n--)
    {
        i = 10;
        while (i--);
    }
}

/**
  *  @brief 粗略延时n ms
  *  @param None
  *  @return None
  */
void delay_n_ms(uint16_t n)
{
    uint16_t i = 0;

    while (n--)
    {
        i = 12000;
        while (i--);
    }
}

/** 私有函数 ------------------------------------------------------- */

