/**
  * @file  delay.c
  * @brief 粗略延时驱动程序
  * @par   date        version    author    remarks
  *        2016-09-22  v1.0       zbt       初次创建
  *
  */ 

/** 头文件包含区 --------------------------------------------------- */
#include "common.h"

/** 私有宏(类型定义) ----------------------------------------------- */ 

/** 外部变量 ------------------------------------------------------- */

/** 私有函数原型 --------------------------------------------------- */

/** 公有函数 ------------------------------------------------------- */

/**
  *  @brief 粗略延时n us
  *  @param None
  *  @return None
  */
void delay_n_us(uint16_t n)
{
    uint8_t i = 0;

    while (n--)
    {
        i = 10;
        while (i--);
    }
}

/**
  *  @brief 粗略延时n ms
  *  @param None
  *  @return None
  */
void delay_n_ms(uint16_t n)
{
    uint16_t i = 0;

    while (n--)
    {
        i = 12000;
        while (i--);
    }
}

/** 私有函数 ------------------------------------------------------- */

