/**
  * @file  bsp.c
  * @brief 模板
  * @par   date        version    author    remarks
  *        2016-10-06  v1.0       zbt       初次创建
  *
  */ 
  
/** 头文件包含区 ------------------------------------------------ */
#include "bsp.h"

/** 私有宏(类型定义) -------------------------------------------- */ 

/** 私有变量 --------------------------------------------------- */ 

/** 外部变量 --------------------------------------------------- */

/** 私有函数原型 ----------------------------------------------- */


/** 公有函数 --------------------------------------------------- */
/**
 *  @brief   延时n_us
 *  @param  [in]n_us	粗略延时
 *  @return None
 */
void delay_n_us(uint32_t n_us)
{
    uint8_t i = 0;

    while (n_us--)
    {
        i = 10;
        while (i--);
    }
}

/**
 *  @brief  延时n_ms
 *  @param  [in] n_ms 粗略延时
 *  @return None
 */
void delay_n_ms(uint32_t n_ms)
{
    uint16_t i = 0;

    while (n_ms--)
    {
        i = 12000;
        while (i--);
    }
}

/**
*  @brief  粗略的延时ms
 *  @param [in] ms 粗略的延时
 *  @return None
 */
void delay_ms(uint16_t ms)
{
	unsigned int i;  
    
	while(ms--) 
	{
		for(i = 0; i < 10000; i++);
	}	
}

/** 私有函数 --------------------------------------------------- */
